package hashset;
import java.util.HashSet;
import java.util.Set;

public class hashset {

//Расписать понимание хешкода, начиная с класса Object.

// if (a==null) return 0;


    public static void main(String[] args) {
//        Set<Object> set = new HashSet<>();
        Object object = new Object();
        Object object2 = new Object();
        Object object3 = new Object();
        object3 = object2;
        int set;
        int set2;
        int set3;
        set = object.hashCode();
        set2 = object2.hashCode();
        set3 = object3.hashCode();
        System.out.println(set+"\n"+set2+"\n"+set3);




    }
}













//        ⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣀⠄⠄⠄⣀⣀⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄
//        ⠄⠄⠄⠄⠄⠄⣀⣶⣿⣿⣿⣿⣾⣿⣿⣿⣿⣿⣇⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄
//        ⠄⠄⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡦⠄⠄⠄⠄⠄⠄⠄⠄⠄
//        ⠄⠄⠄⠄⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠄⠄⠄⠄⠄⠄⠄⠄
//        ⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠄⠄⠄⠄⠄⠄⠄
//        ⠄⠄⠄⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠄⠄⠄⠄⠄⠄
//        ⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠿⠛⠉⠛⠁⠈⠈⠻⣿⣿⠄⠄⠄⠄⠄⠄
//        ⠄⠄⢰⣿⣿⣿⠛⠿⠿⠛⠋⠉⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠙⣿⡆⠄⠄⠄⠄⠄
//        ⠄⠄⠄⣿⣿⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠸⡇⠄⠄⠄⠄⠄
//        ⠄⠄⠄⠸⣿⡇⠄⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣀⠄⠄⠄⠄⢻⣀⣠⢤⣤⡀
//        ⠄⠄⠄⠄⢹⡇⠄⠄⠄⠄⠄⠄⠄⠄⠐⣤⣴⣾⣿⣿⢶⡄⠄⠄⢀⠴⠇⠄⠸⣷
//        ⠄⢀⣀⣀⣼⡅⢴⣶⣶⣿⣷⣿⣿⠏⠄⠄⠙⠿⠽⠋⠄⠄⠄⠄⠋⢰⣦⠄⢀⡏
//        ⢰⣿⡟⢹⣿⡆⠙⠛⠛⠟⠃⠛⡟⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠙⠃⡼⠄
//        ⠐⣾⡆⣾⣿⡇⠄⠄⠄⠄⠄⢸⣷⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⠜⠁⠄
//        ⠄⠘⣧⢿⡿⣿⡄⠄⠄⠄⠄⣼⣿⣶⣄⠠⣤⠄⠄⠄⠄⠄⠄⠄⡔⠖⠋⠄⠄⠄
//        ⠄⠄⠹⣛⡓⠾⣿⣧⠄⠄⠄⠈⢹⣿⡛⡀⠄⠄⠄⠄⠄⠄⠄⢀⠃⠄⠄⠄⠄⠄
//        ⠄⠄⠄⠄⠉⠉⠉⢹⠄⠄⠄⣠⣾⣿⣷⣤⠤⠤⠤⠄⠄⠄⠄⡸⠄⠄⠄⠄⠄⠄
//        ⠄⠄⠄⠄⠄⠄⠄⠘⣧⣄⠘⠿⣿⣧⣀⣄⣄⡀⠄⠄⠄⢀⠞⠁⠄⠄⠄⠄⠄⠄
//        ⠄⠄⠄⠄⠄⠄⠄⠄⠙⢷⣄⠄⠄⠉⠉⠉⠁⠄⢀⣀⠴⠃⠄⠄⠄⠄⠄⠄⠄⠄
//        ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠉⠓⠶⠶⠶⠶⠖⠚⠋⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄

